doc/release-notes/RELEASE-NOTES.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-27 Tue 14:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PBench release notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nick Dokos" />
<meta name="keywords" content="pbench" />
<link rel="stylesheet" href="../../stylesheets/normalize.css" type="text/css"/>
<link rel="stylesheet" href="../../stylesheets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" href="../../stylesheets/github-light.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">PBench release notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6120302">Version 0.43</a>
<ul>
<li><a href="#org82ee1e6">Installation</a></li>
<li><a href="#orgef73b2c">agent</a></li>
<li><a href="#orga4e8277">server</a></li>
<li><a href="#web-server-0.43">web-server</a></li>
<li><a href="#org91b43b4">Changelog</a></li>
</ul>
</li>
<li><a href="#org1666ecb">Version 0.42</a>
<ul>
<li><a href="#orge5686b9">Installation</a></li>
<li><a href="#orgd81715a">agent</a></li>
<li><a href="#org1acb57f">server</a></li>
<li><a href="#web-server-0.42">web-server</a></li>
<li><a href="#orga455427">Changelog</a></li>
</ul>
</li>
<li><a href="#org9bac501">Version 0.42</a>
<ul>
<li><a href="#org6cc7c46">Installation</a></li>
<li><a href="#org62d3953">agent</a></li>
<li><a href="#org3463eda">server</a></li>
<li><a href="#web-server-0.42">web-server</a></li>
<li><a href="#orge2784e6">Changelog</a></li>
</ul>
</li>
<li><a href="#orgf721324">Version 0.41</a>
<ul>
<li><a href="#org4a4d303">Installation</a></li>
<li><a href="#org1ffe197">agent</a></li>
<li><a href="#org6a5e032">server</a></li>
<li><a href="#web-server-0.41">web-server</a></li>
<li><a href="#orgb5abab3">Changelog</a></li>
</ul>
</li>
<li><a href="#org792aea6">Version 0.40</a>
<ul>
<li><a href="#org8ef1c15">Installation</a></li>
<li><a href="#org2712a93">agent</a></li>
<li><a href="#org67bd0a9">server</a></li>
<li><a href="#web-server-0.40">web-server</a></li>
<li><a href="#org9a808a3">Changelog</a></li>
</ul>
</li>
<li><a href="#org47fcef8">Version 0.39</a>
<ul>
<li><a href="#org76f069c">Installation</a></li>
<li><a href="#org47f2c4c">agent</a></li>
<li><a href="#orgc5a4114">server</a></li>
<li><a href="#web-server-0.39">web-server</a></li>
<li><a href="#org9d680e3">Changelog</a></li>
</ul>
</li>
<li><a href="#orge79d8b1">Version 0.38</a>
<ul>
<li><a href="#org5122b32">Installation</a></li>
<li><a href="#org8b197d0">agent</a></li>
<li><a href="#orgefaa791">server</a></li>
<li><a href="#orgb9333f3">web-server</a></li>
<li><a href="#org0c88b7c">Fedora 24 RPMs on COPR</a></li>
<li><a href="#org0808282">Changelog</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6120302" class="outline-2">
<h2 id="org6120302">Version 0.43</h2>
<div class="outline-text-2" id="text-org6120302">
</div>
<div id="outline-container-org82ee1e6" class="outline-3">
<h3 id="org82ee1e6">Installation</h3>
<div class="outline-text-3" id="text-org82ee1e6">
<p>
There are no installation changes in this release: see the
<a href="../agent/installation.html">Installation Instructions</a> for how to install or update.
</p>

<p>
After installation or update, you should have version 0.43-1g87c4f83
of the pbench-agent RPM installed.
</p>
</div>
</div>
