doc/release-notes/RELEASE-NOTES.org
** Changelog
This is the list of visible (non-merge, non-unit-test-related) commits
since v0.40:

- f780656 Fix a latency processing bug in moongen-postprocess
- 8a9f445 Unit test gold files changes for PR#434
- bc787eb Fix benchmark postprocessing infloop
- d8ef7ff Add a "Misc. Controls" panel to the jschart table
- eced272 Don't call fiologparser_hist.py twice
- 49fafc2 Fix iostat unit tests.
- aca5ffc Change the iostat keys to more accurately reflect the nature of the metrics
- 4580156 Fix iostat unit tests
- eadcde1 Change the keys of the iostat hash to make them more descriptive
- 9672161 Collect the kernel config file
- f9bc55a use correct units for fio histogram-derived latency graph
- e1a6825 add 95th percentile to fio histogram-derived latency graph
- acfff77 Update jschart by adding dataset cursor value locking
- 5426fab Update jschart to sort the table datasets by value
- f902160 pass job file to fiologparser_hist.py
- 5068ed0 Fix short-form -n option
- be6172f Only display the information about the location of the test results when actually running a test
- 2a80577 The script does not require any options for the install-only mode, therefore prevent checking the test options
- b487f24 Changes the order on which the help options are presented to the user to match the order they are declared
- a505370 Fixes handling of long options, which were missing in the previous versions of the script
- f207c4b Removes the logic to set the default throttle because it is already set earlier
- 02d8ae7 Added support for 'install only' option, which can be used to install mpt dependencies on the test host
- 27547a3 Added support for installing packages from Fedora COPR repositories (WIP)
- 076f496 Minor cleanups by removing unused code on pbench-mpt script
- 1badc9e Added a simple runner script for msg-perf-tool.
- 35ee777 Fix incorrect addressing of 'webserver' variable that would prevent rendering host_info_url setting.
- dc14a7b Downgrade sysstat further to 11.2.0
- 84878ca Downgrade pbench-sysstat req to 11.4.1
- d413085 Allow the user to tell pbench-moongen to accept negative packet loss
- 7bb0c24 Update pbench-moongen to use lua-trafficgen
- 47cca9c Parse new moongen output to find latency data
- 5f898e3 Bump the required sysstat version to 11.5.1
- 6ac5318 Event collection has to be for all namespaces
- 3e03486 Typo
- dbefb1b Crontab entries for satellite handling
- e4d9fe9 Define all relevant variables in pbench-base.sh
- 4b473f7 Improvements to status email
- d23a302 Clean up the status mail
- bbffa61 pbench-rsync-satellite: Fix tarball deletions and send status email

* Version 0.40

** Installation                                                    :external:
There are no installation changes in this release: see the
[[file:../agent/installation.org][Installation Instructions]] for how to install.

After installation or update, you should have version 0.40-1gf281562
of the pbench-agent RPM installed.

** agent

*** Backward incompatibilities
None known.

*** Bug fixes and enhancements

User-visible changes include:

**** =pbench-fio=
The pbench-fio script has undergone significant enhancements in order
to take advantage of several facilities implemented in the upstream fio
project. In particular, it gathers and reports latency histograms as
implemented by Karl Cronburg.

*N.B.* The script that processes the logs to get the histograms uses the
Python Pandas library. This script only runs on the controller, so the
library has to be installed there. =pbench-fio= tries to install the library
and it should succeed e.g. on Fedora systems. On RHEL systems however, the
=python-pandas= library is available from EPEL, but not from the standard
installation repos. You will therefore need to install the EPEL repo before
running =pbench-fio= on your controller. Details on EPEL can be found [[https://fedoraproject.org/wiki/EPEL][here]].

The process is as follows: on your RHEL7 controller (and similarly for RHEL6)
#+BEGIN_EXAMPLE
cd /tmp
curl --output ./epel-release-latest-7.noarch.rpm  https://dl.fedoraproject.org/pub/epel/epel-release-latest-7.noarch.rpm
yum install ./epel-release-latest-7.noarch.rpm
#+END_EXAMPLE
After that, the =pbench-fio= script should be able to find and install
the =python-pandas= package.

*N.B.* You need the 2.14-9 (or later) version of the pbench-fio RPM,
which is available from the COPR pbench repo. This RPM is based on current
upstream fio master. The =pbench-fio= script will check for and install
this version, but please bear the dependency in mind if something goes
wrong.

You can now explicitly pass a fio job file to the script, instead of
or in addition to specifying fio options on the command line. We generally
recommend using the command line options for simple usage where that suffices,
but if you need options that =pbench-fio= does not implement, then using
a job file will be necessary.

You can run fio on a set of clients either by using the --clients=... option
to =pbench-fio=, explicitly listing the set of clients; or you can use the
--client-file=... option to pass a file containing the list of clients, one
client per line.

**** =pbench-moongen=
New options.

**** pbench-user-benchmark
The variable specifying the run directory, =benchmark_run_dir=, is now
exported by the main script, making it available to the user-provided
benchmark script (e.g. for squirreling away stuff to package up with the
rest of the data for storage/processing on the server).

This is only one part of a larger [[https://github.com/distributed-system-analysis/pbench/issues/349][issue #349]].

**** Triggers
Trigger functionality has been restored.

**** Hardening of tools-<group> directory handling
In some cases, additional files or subdirectories in the tools-default (or
more generally, tools-<group>) directory have caused problems. We now skip
subdirectories and check files against the available tools list, skipping
any that don't match. A warning is issued in either case suggesting that
the suspect file/subdirectory be removed.

**** Fixes to graph rendering
See [[#web-server-0.40][web-server]] below.

** server

- Add mail notifications to the scripts that backs up results tarballs
  for safekeeping.

- Add verification script to detect bit-rot in tarballs.

- We now run a cron job to fetch tarballs from "satellite" servers and
  store them on our "production" server. The intent is to relieve some
  of the disk space pressure on the satellite, and to take advantage
  of the backup and bit-rot detection facilities that we employ on the
  production server.

- An additional script to age out results on a satellite server is in
  the works but is not running yet.

