doc/release-notes/RELEASE-NOTES.html

<div id="outline-container-orgb5abab3" class="outline-3">
<h3 id="orgb5abab3">Changelog</h3>
<div class="outline-text-3" id="text-orgb5abab3">
<p>
This is the list of visible (non-merge, non-unit-test-related) commits
since v0.40:
</p>

<ul class="org-ul">
<li>f780656 Fix a latency processing bug in moongen-postprocess</li>
<li>8a9f445 Unit test gold files changes for PR#434</li>
<li>bc787eb Fix benchmark postprocessing infloop</li>
<li>d8ef7ff Add a "Misc. Controls" panel to the jschart table</li>
<li>eced272 Don't call fiologparser_hist.py twice</li>
<li>49fafc2 Fix iostat unit tests.</li>
<li>aca5ffc Change the iostat keys to more accurately reflect the nature of the metrics</li>
<li>4580156 Fix iostat unit tests</li>
<li>eadcde1 Change the keys of the iostat hash to make them more descriptive</li>
<li>9672161 Collect the kernel config file</li>
<li>f9bc55a use correct units for fio histogram-derived latency graph</li>
<li>e1a6825 add 95th percentile to fio histogram-derived latency graph</li>
<li>acfff77 Update jschart by adding dataset cursor value locking</li>
<li>5426fab Update jschart to sort the table datasets by value</li>
<li>f902160 pass job file to fiologparser_hist.py</li>
<li>5068ed0 Fix short-form -n option</li>
<li>be6172f Only display the information about the location of the test results when actually running a test</li>
<li>2a80577 The script does not require any options for the install-only mode, therefore prevent checking the test options</li>
<li>b487f24 Changes the order on which the help options are presented to the user to match the order they are declared</li>
<li>a505370 Fixes handling of long options, which were missing in the previous versions of the script</li>
<li>f207c4b Removes the logic to set the default throttle because it is already set earlier</li>
<li>02d8ae7 Added support for 'install only' option, which can be used to install mpt dependencies on the test host</li>
<li>27547a3 Added support for installing packages from Fedora COPR repositories (WIP)</li>
<li>076f496 Minor cleanups by removing unused code on pbench-mpt script</li>
<li>1badc9e Added a simple runner script for msg-perf-tool.</li>
<li>35ee777 Fix incorrect addressing of 'webserver' variable that would prevent rendering host_info_url setting.</li>
<li>dc14a7b Downgrade sysstat further to 11.2.0</li>
<li>84878ca Downgrade pbench-sysstat req to 11.4.1</li>
<li>d413085 Allow the user to tell pbench-moongen to accept negative packet loss</li>
<li>7bb0c24 Update pbench-moongen to use lua-trafficgen</li>
<li>47cca9c Parse new moongen output to find latency data</li>
<li>5f898e3 Bump the required sysstat version to 11.5.1</li>
<li>6ac5318 Event collection has to be for all namespaces</li>
<li>3e03486 Typo</li>
<li>dbefb1b Crontab entries for satellite handling</li>
<li>e4d9fe9 Define all relevant variables in pbench-base.sh</li>
<li>4b473f7 Improvements to status email</li>
<li>d23a302 Clean up the status mail</li>
<li>bbffa61 pbench-rsync-satellite: Fix tarball deletions and send status email</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org792aea6" class="outline-2">
<h2 id="org792aea6">Version 0.40</h2>
<div class="outline-text-2" id="text-org792aea6">
</div>
<div id="outline-container-org8ef1c15" class="outline-3">
<h3 id="org8ef1c15">Installation</h3>
<div class="outline-text-3" id="text-org8ef1c15">
<p>
There are no installation changes in this release: see the
<a href="../agent/installation.html">Installation Instructions</a> for how to install.
</p>

<p>
After installation or update, you should have version 0.40-1gf281562
of the pbench-agent RPM installed.
</p>
</div>
</div>

<div id="outline-container-org2712a93" class="outline-3">
<h3 id="org2712a93">agent</h3>
<div class="outline-text-3" id="text-org2712a93">
</div>
<ul class="org-ul">
<li><a id="org2c0eb67"></a>Backward incompatibilities<br />
<div class="outline-text-4" id="text-org2c0eb67">
<p>
None known.
</p>
</div>
</li>

<li><a id="orgc352415"></a>Bug fixes and enhancements<br />
<div class="outline-text-4" id="text-orgc352415">
<p>
User-visible changes include:
</p>
</div>

<ul class="org-ul">
<li><a id="orgbe971b2"></a><code>pbench-fio</code><br />
<div class="outline-text-5" id="text-orgbe971b2">
<p>
The pbench-fio script has undergone significant enhancements in order
to take advantage of several facilities implemented in the upstream fio
project. In particular, it gathers and reports latency histograms as
implemented by Karl Cronburg.
</p>

<p>
<b>N.B.</b> The script that processes the logs to get the histograms uses the
Python Pandas library. This script only runs on the controller, so the
library has to be installed there. <code>pbench-fio</code> tries to install the library
and it should succeed e.g. on Fedora systems. On RHEL systems however, the
<code>python-pandas</code> library is available from EPEL, but not from the standard
installation repos. You will therefore need to install the EPEL repo before
running <code>pbench-fio</code> on your controller. Details on EPEL can be found <a href="https://fedoraproject.org/wiki/EPEL">here</a>.
</p>

<p>
The process is as follows: on your RHEL7 controller (and similarly for RHEL6)
</p>
<pre class="example">
cd /tmp
curl --output ./epel-release-latest-7.noarch.rpm  https://dl.fedoraproject.org/pub/epel/epel-release-latest-7.noarch.rpm
yum install ./epel-release-latest-7.noarch.rpm
</pre>
<p>
After that, the <code>pbench-fio</code> script should be able to find and install
the <code>python-pandas</code> package.
</p>

<p>
<b>N.B.</b> You need the 2.14-9 (or later) version of the pbench-fio RPM,
which is available from the COPR pbench repo. This RPM is based on current
upstream fio master. The <code>pbench-fio</code> script will check for and install
this version, but please bear the dependency in mind if something goes
wrong.
</p>

<p>
You can now explicitly pass a fio job file to the script, instead of
or in addition to specifying fio options on the command line. We generally
recommend using the command line options for simple usage where that suffices,
but if you need options that <code>pbench-fio</code> does not implement, then using
a job file will be necessary.
</p>

<p>
You can run fio on a set of clients either by using the &#x2013;clients=&#x2026; option
to <code>pbench-fio</code>, explicitly listing the set of clients; or you can use the
&#x2013;client-file=&#x2026; option to pass a file containing the list of clients, one
client per line.
</p>
</div>
</li>

<li><a id="org1a41f46"></a><code>pbench-moongen</code><br />
<div class="outline-text-5" id="text-org1a41f46">
<p>
New options.
</p>
</div>
</li>

<li><a id="org991edcd"></a>pbench-user-benchmark<br />
<div class="outline-text-5" id="text-org991edcd">
<p>
The variable specifying the run directory, <code>benchmark_run_dir</code>, is now
exported by the main script, making it available to the user-provided
benchmark script (e.g. for squirreling away stuff to package up with the
rest of the data for storage/processing on the server).
</p>

<p>
This is only one part of a larger <a href="https://github.com/distributed-system-analysis/pbench/issues/349">issue #349</a>.
</p>
</div>
</li>

<li><a id="orge980a2d"></a>Triggers<br />
<div class="outline-text-5" id="text-orge980a2d">
<p>
Trigger functionality has been restored.
</p>
</div>
</li>

<li><a id="org79d8fb2"></a>Hardening of tools-&lt;group&gt; directory handling<br />
<div class="outline-text-5" id="text-org79d8fb2">
<p>
In some cases, additional files or subdirectories in the tools-default (or
more generally, tools-&lt;group&gt;) directory have caused problems. We now skip
subdirectories and check files against the available tools list, skipping
any that don't match. A warning is issued in either case suggesting that
the suspect file/subdirectory be removed.
</p>
</div>
</li>

<li><a id="org9cb9391"></a>Fixes to graph rendering<br />
<div class="outline-text-5" id="text-org9cb9391">
<p>
See <a href="#web-server-0.40">web-server</a> below.
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org67bd0a9" class="outline-3">
<h3 id="org67bd0a9">server</h3>
<div class="outline-text-3" id="text-org67bd0a9">
<ul class="org-ul">
<li>Add mail notifications to the scripts that backs up results tarballs
for safekeeping.</li>

<li>Add verification script to detect bit-rot in tarballs.</li>

<li>We now run a cron job to fetch tarballs from "satellite" servers and
store them on our "production" server. The intent is to relieve some
of the disk space pressure on the satellite, and to take advantage
of the backup and bit-rot detection facilities that we employ on the
production server.</li>

<li>An additional script to age out results on a satellite server is in
the works but is not running yet.</li>
</ul>
</div>
</div>
