doc/release-notes/RELEASE-NOTES.org
** web-server
:PROPERTIES:
:CUSTOM_ID: web-server-0.40
:END:
The pbench-web-server RPM has been updated with many fixes, cleanups
and optimizations. The major user-visible change is better handling
of outliers - see [[https://github.com/distributed-system-analysis/pbench/issues/317][issue #317]].

If you have it installed, you probably want to update:
#+BEGIN_EXAMPLE
dnf clean expire-cache
dnf update pbench-web-server
#+END_EXAMPLE
(or the yum equivalents.)  The current version available from COPR
is 0.40-1gf281562.

** Changelog
This is the list of visible (non-merge, non-unit-test-related) commits
since v0.39:

- 5409667 Make client file pathname absolute
- 0192eda Check for and install python-pandas
- fa328b4 use a smaller port number increment to allow greater scalability
- 7e98d63 change --cache-drop-script to --pre-iteration-script
- 988c586 Add --dst-macs option to pbench-moongen
- c7420f9 Save client file in the run directory
- 19cf29d Redirect various "No such file or directory" messages to /dev/null
- 1301c1a Fix label complaint in tools-<group> sanity checking code
- de11f82 Pass file from --client-file option directly to fio
- f53293a pbench-list-triggers rewrite.
- cd3dfb5 Grammar and spelling updates to the jschart docs
- fa45c15 Check for spurious files/subdirectories of tools-<group> dir
- e19d81a Fix triggers
- 4a83b02 Update jschart API call in fio-postprocess-viz.py
- ad84dca Update unit tests for new jschart API
- 0cfe6b7 Add View Port Controls to jschart
- 1fd5b11 Use the create_jschart interface
- 5dad7d0 Add documentation to jschart and do minor cleanups
- 60f2a52 Update jschart to include the number of histogram buckets in the table
- abdcec5 Update jschart to show the datapoints on highlighted datasets for histogram and xy charts
- 1cb8864 Delete remote tarballs after checking.
- 480b20a Sync satellite to master.
- 4c1f1e4 Move bad-md5 links to their own state directory.
- 9202d3d Fix some typos in pbench-uperf help strings.
- 7d0f360 Add/fix help string to pbench_fio.
- 65de78b Add verify script for backup tarballs.
- cc8594a Fix a subsitution bug in BenchPostprocess::get_uid
- b8995ed Add new MoonGen queue control options
- 3a13b5a Process only the last moongen validation phase
- d21fd21 Add mail notification for pbench-backup-tarballs
- 0465506 Fixes to fully handle epoch time: - Parse job file from fio-postprocess-viz.py to detect when log_unix_epoch is present (using 'timeseries' instead of 'xy' in jschart) - jschart expects ms not s (no more divide by 1000 on time values) - Pass job file parameter whenever we call fiologparser_hist.py and fio-postproces-viz.py - Update to make-fio-jobfile.py to handle config options without values (e.g. 'stonewall' in fio)
- b0fff69 Add pprof heap support
- 930ee68 Run fiologparser_hist.py during postprocessing, and generate jschart HTML docs showing the histogram data for each individual sample as well as (merged) across all samples for a particular iteration.
- 1c52ee2 Make the run directory available to the called user script.
- debc148 Templating prototype for `pbench-fio`, using config files to specify fio parameters. The order of precedence used is as follows: (from high to low)
- 5958d94 Add --client-file option to specify a list of clients
- 3fd2741 Remove redundant $bench_opts
- bbe6b9b Ensure --samples is documented in --help
- f9d939e Ensure $client is assigned before it is referenced
- a5ed3eb use correct benchmark name
- da5928e Respect GOROOT env var if set
- 5969500 Fix exit status of pbench-{move/copy}-results.

* Version 0.39

** Installation                                                    :external:
There are no installation changes in this release: see the
[[file:../agent/installation.org][Installation Instructions]] for how to install.

After installation or update, you should have version 0.39-3g4f9ab11
of the pbench-agent RPM installed.

** agent
*** Backward incompatibilities
**** pbench-agent config file renamed
All configuration files now have a suffix of ".cfg", rather than
".conf".  In particular, the default pbench-agent config file is now
~/opt/pbench-agent/config/pbench-agent.cfg~.  You might have to rename
your existing config file:
#+BEGIN_EXAMPLE
cd /opt/pbench-agent/config
mv pbench-agent.conf pbench-agent.cfg
#+END_EXAMPLE
If you have problems (e.g. =pbench-register-tool-set= only registers the ~perf~
tool, rather than a complete set; =pbench-move-results= fails because it cannot
find a server), check with:
#+BEGIN_EXAMPLE
cat $CONFIG
#+END_EXAMPLE
If that fails, then pbench cannot find the config file, most probably because
of the renaming described above.
**** pbench-netperf script has bit-rotted
The pbench-netperf script seems to have bit-rotted. We are trying to
decide whether to fix it or abandon it. If you have an opinion, please
comment at https://github.com/distributed-system-analysis/pbench/issues/291.

*** New features
Please submit suggestions/issues to the [[https://github.com/distributed-system-analysis/pbench/issues][issue tracker]].

**** JSON files for pbench-uperf
The postprocessing now produces JSON files that we are planning to use
in order to index benchmark results and tool output into ES. The
backend work necessary to index these results will be done between
v0.39 and v0.40 and might necessitate changes to the JSON output. So
pbench-uperf is treated as a guinea pig and once the output format
solidifies, the rest of the benchmarks are going to be converted as
well, probably starting with pbench-fio.

A large part of the work for pbench-uperf has been to refactor the
pbench-uperf script, so that the resulting pieces can be
reused. Andrew hopes to have 90% of each benchmark script code in
reusable packages, which will also simplify adding new scripts in the
future.

**** The pbench docs on github have been revamped
The docs can now be processed in two ways: to produce "internal"
documents, including the more automated installation that is possible
internally, as well as "external" documents that are more generic and
depend only on externally available resources.

The docs on github have been replaced by the "external" documents:
there are still some ~example.com~ fake URLs (clearly marked, we hope)
but almost all URLs now point to their correct referent and the instructions
should be enough to get pbench-agent/pbench-server/pbench-web-server installed
in an arbitrary environment, but with some manual work required (again, clearly
described, we hope, even if it is somewhat laborious).

*** Bug fixes

**** Better error handling by utility scripts
In particular, errors in ssh invocations in pipelines are caught and returned
properly. More work is planned in this area for upcoming releases, in particular
hardening the benchmark scripts so that they deal better with errors and signals.

