doc/release-notes/RELEASE-NOTES.html

<div id="outline-container-orgbf57add" class="outline-3">
<h3 id="web-server-0.40"><a id="orgbf57add"></a>web-server</h3>
<div class="outline-text-3" id="text-web-server-0.40">
<p>
The pbench-web-server RPM has been updated with many fixes, cleanups
and optimizations. The major user-visible change is better handling
of outliers - see <a href="https://github.com/distributed-system-analysis/pbench/issues/317">issue #317</a>.
</p>

<p>
If you have it installed, you probably want to update:
</p>
<pre class="example">
dnf clean expire-cache
dnf update pbench-web-server
</pre>
<p>
(or the yum equivalents.)  The current version available from COPR
is 0.40-1gf281562.
</p>
</div>
</div>

<div id="outline-container-org9a808a3" class="outline-3">
<h3 id="org9a808a3">Changelog</h3>
<div class="outline-text-3" id="text-org9a808a3">
<p>
This is the list of visible (non-merge, non-unit-test-related) commits
since v0.39:
</p>

<ul class="org-ul">
<li>5409667 Make client file pathname absolute</li>
<li>0192eda Check for and install python-pandas</li>
<li>fa328b4 use a smaller port number increment to allow greater scalability</li>
<li>7e98d63 change &#x2013;cache-drop-script to &#x2013;pre-iteration-script</li>
<li>988c586 Add &#x2013;dst-macs option to pbench-moongen</li>
<li>c7420f9 Save client file in the run directory</li>
<li>19cf29d Redirect various "No such file or directory" messages to /dev/null</li>
<li>1301c1a Fix label complaint in tools-&lt;group&gt; sanity checking code</li>
<li>de11f82 Pass file from &#x2013;client-file option directly to fio</li>
<li>f53293a pbench-list-triggers rewrite.</li>
<li>cd3dfb5 Grammar and spelling updates to the jschart docs</li>
<li>fa45c15 Check for spurious files/subdirectories of tools-&lt;group&gt; dir</li>
<li>e19d81a Fix triggers</li>
<li>4a83b02 Update jschart API call in fio-postprocess-viz.py</li>
<li>ad84dca Update unit tests for new jschart API</li>
<li>0cfe6b7 Add View Port Controls to jschart</li>
<li>1fd5b11 Use the create_jschart interface</li>
<li>5dad7d0 Add documentation to jschart and do minor cleanups</li>
<li>60f2a52 Update jschart to include the number of histogram buckets in the table</li>
<li>abdcec5 Update jschart to show the datapoints on highlighted datasets for histogram and xy charts</li>
<li>1cb8864 Delete remote tarballs after checking.</li>
<li>480b20a Sync satellite to master.</li>
<li>4c1f1e4 Move bad-md5 links to their own state directory.</li>
<li>9202d3d Fix some typos in pbench-uperf help strings.</li>
<li>7d0f360 Add/fix help string to pbench_fio.</li>
<li>65de78b Add verify script for backup tarballs.</li>
<li>cc8594a Fix a subsitution bug in BenchPostprocess::get_uid</li>
<li>b8995ed Add new MoonGen queue control options</li>
<li>3a13b5a Process only the last moongen validation phase</li>
<li>d21fd21 Add mail notification for pbench-backup-tarballs</li>
<li>0465506 Fixes to fully handle epoch time: - Parse job file from fio-postprocess-viz.py to detect when log_unix_epoch is present (using 'timeseries' instead of 'xy' in jschart) - jschart expects ms not s (no more divide by 1000 on time values) - Pass job file parameter whenever we call fiologparser_hist.py and fio-postproces-viz.py - Update to make-fio-jobfile.py to handle config options without values (e.g. 'stonewall' in fio)</li>
<li>b0fff69 Add pprof heap support</li>
<li>930ee68 Run fiologparser_hist.py during postprocessing, and generate jschart HTML docs showing the histogram data for each individual sample as well as (merged) across all samples for a particular iteration.</li>
<li>1c52ee2 Make the run directory available to the called user script.</li>
<li>debc148 Templating prototype for `pbench-fio`, using config files to specify fio parameters. The order of precedence used is as follows: (from high to low)</li>
<li>5958d94 Add &#x2013;client-file option to specify a list of clients</li>
<li>3fd2741 Remove redundant $bench_opts</li>
<li>bbe6b9b Ensure &#x2013;samples is documented in &#x2013;help</li>
<li>f9d939e Ensure $client is assigned before it is referenced</li>
<li>a5ed3eb use correct benchmark name</li>
<li>da5928e Respect GOROOT env var if set</li>
<li>5969500 Fix exit status of pbench-{move/copy}-results.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org47fcef8" class="outline-2">
<h2 id="org47fcef8">Version 0.39</h2>
<div class="outline-text-2" id="text-org47fcef8">
</div>
<div id="outline-container-org76f069c" class="outline-3">
<h3 id="org76f069c">Installation</h3>
<div class="outline-text-3" id="text-org76f069c">
<p>
There are no installation changes in this release: see the
<a href="../agent/installation.html">Installation Instructions</a> for how to install.
</p>

<p>
After installation or update, you should have version 0.39-3g4f9ab11
of the pbench-agent RPM installed.
</p>
</div>
</div>

<div id="outline-container-org47f2c4c" class="outline-3">
<h3 id="org47f2c4c">agent</h3>
<div class="outline-text-3" id="text-org47f2c4c">
</div>
<ul class="org-ul">
<li><a id="orgf40d518"></a>Backward incompatibilities<br />
<ul class="org-ul">
<li><a id="orgd372e53"></a>pbench-agent config file renamed<br />
<div class="outline-text-5" id="text-orgd372e53">
<p>
All configuration files now have a suffix of ".cfg", rather than
".conf".  In particular, the default pbench-agent config file is now
<code>/opt/pbench-agent/config/pbench-agent.cfg</code>.  You might have to rename
your existing config file:
</p>
<pre class="example">
cd /opt/pbench-agent/config
mv pbench-agent.conf pbench-agent.cfg
</pre>
<p>
If you have problems (e.g. <code>pbench-register-tool-set</code> only registers the <code>perf</code>
tool, rather than a complete set; <code>pbench-move-results</code> fails because it cannot
find a server), check with:
</p>
<pre class="example">
cat $CONFIG
</pre>
<p>
If that fails, then pbench cannot find the config file, most probably because
of the renaming described above.
</p>
</div>
</li>
<li><a id="orgf7f4fb1"></a>pbench-netperf script has bit-rotted<br />
<div class="outline-text-5" id="text-orgf7f4fb1">
<p>
The pbench-netperf script seems to have bit-rotted. We are trying to
decide whether to fix it or abandon it. If you have an opinion, please
comment at <a href="https://github.com/distributed-system-analysis/pbench/issues/291">https://github.com/distributed-system-analysis/pbench/issues/291</a>.
</p>
</div>
</li>
</ul>
</li>

<li><a id="org3f78bbd"></a>New features<br />
<div class="outline-text-4" id="text-org3f78bbd">
<p>
Please submit suggestions/issues to the <a href="https://github.com/distributed-system-analysis/pbench/issues">issue tracker</a>.
</p>
</div>

<ul class="org-ul">
<li><a id="org98558bf"></a>JSON files for pbench-uperf<br />
<div class="outline-text-5" id="text-org98558bf">
<p>
The postprocessing now produces JSON files that we are planning to use
in order to index benchmark results and tool output into ES. The
backend work necessary to index these results will be done between
v0.39 and v0.40 and might necessitate changes to the JSON output. So
pbench-uperf is treated as a guinea pig and once the output format
solidifies, the rest of the benchmarks are going to be converted as
well, probably starting with pbench-fio.
</p>

<p>
A large part of the work for pbench-uperf has been to refactor the
pbench-uperf script, so that the resulting pieces can be
reused. Andrew hopes to have 90% of each benchmark script code in
reusable packages, which will also simplify adding new scripts in the
future.
</p>
</div>
</li>

<li><a id="orge0edba1"></a>The pbench docs on github have been revamped<br />
<div class="outline-text-5" id="text-orge0edba1">
<p>
The docs can now be processed in two ways: to produce "internal"
documents, including the more automated installation that is possible
internally, as well as "external" documents that are more generic and
depend only on externally available resources.
</p>

<p>
The docs on github have been replaced by the "external" documents:
there are still some <code>example.com</code> fake URLs (clearly marked, we hope)
but almost all URLs now point to their correct referent and the instructions
should be enough to get pbench-agent/pbench-server/pbench-web-server installed
in an arbitrary environment, but with some manual work required (again, clearly
described, we hope, even if it is somewhat laborious).
</p>
</div>
</li>
</ul>
</li>

<li><a id="org991de59"></a>Bug fixes<br />
<ul class="org-ul">
<li><a id="orgc73b784"></a>Better error handling by utility scripts<br />
<div class="outline-text-5" id="text-orgc73b784">
<p>
In particular, errors in ssh invocations in pipelines are caught and returned
properly. More work is planned in this area for upcoming releases, in particular
hardening the benchmark scripts so that they deal better with errors and signals.
</p>
</div>
</li>
