doc/release-notes/RELEASE-NOTES.org
**** Safer killing of tools
A safer kill has been implemented for all the tools that are linked to
=kvm-spinlock=.  Assuming no problems surface, the sar-based tools
will get the same treatment in upcoming releases.

**** Screen session names were too long
The screen command fails when the name of the screen session (-S) is
very long. This happens when the iteration full name is quite long. A
fix for this uses only the iteration number, reducing the screen
name to a safe length.
**** Fixes to graph rendering
See [[#web-server-0.39][web-server]] below.

** server
Server installation was simplified in v0.38: there is an RPM on COPR that can be used
for installation, but as for the pbench-agent, it is not completely self-contained: one
needs to install various configuration files and generate a directory structure for apache,
a directory structure for results and a crontab that invokes the various scripts to process
incoming results and make them available for viewing on the web.

This release adds scripts to do these tasks somewhat more conveniently. It is possible to
use these scripts from an RPM that installs the config files and then invokes the scripts to
finish the installation. But it is also possible to do these steps manually. See the
[[file:~/src/internal/pbench/doc/server/installation.org][server installation guide]] for details.

** web-server
:PROPERTIES:
:CUSTOM_ID: web-server-0.39
:END:
The pbench-web-server RPM has been updated with many fixes, cleanups
and optimizations.  Changes that are user-visible are:

- Update jschart to better handle errors while loading datasets
- Update jschart to support alternative csv file formatting
- Fix a jschart bug where the wrong clip-path is referenced
- Update jschart to add percentiles to the values displayed in the
  table when the mouse is moving across a histogram chart

If you have it installed, you probably want to update:
#+BEGIN_EXAMPLE
dnf clean expire-cache
dnf update pbench-web-server
#+END_EXAMPLE
(or the yum equivalents.)  The current version available from COPR
is 0.3-19gaf1ffe4.

** Changelog
- 9c2554f Bump versions for various benchmarks.
- a02ad33 Bump VERSION.
- 48b8c27 Fix condition for warning of already running tools.
- f4f5618 Add unit tests.
- cf59a06 Check status of backgrounded commands in pbench-postprocess-tools.
- fe15a81 Catch pipeline failures and return proper error status.
- 75ca51c Use pidof -x to get list of pids.
- 7bbb4dd Revert the change to perf.
- 11a0ad9 Add unit tests for safe_kill.
- fa80b08 Safer kill: check for strange situations and deal with them.
- 862e68b Change the name of the config file in profile.
- 9e0ecef Fix pbench-agent-config-activate and add unit test.
- 19039eb Allow partial execution of unittests.
- 57b56e7 Fix links to point to DSA github.io area.
- d720f61 updated pprof to point to correct package name for "go" it is golang, not go - added tool_bin to point to /usr/bin/go
- ee321d6 Add missing '$'
- d38ba9b Reduce screen session name to avoid screen error
- 66c6996 Update jschart's d3-queue support from version 2 to version 3
- bc34df8 Update jschart to support alternative csv file formatting
- 343f715 Fix a jschart bug where the wrong clip-path is referenced
- 333978c Update jschart to add percentiles to the values displayed in the table when the mouse is moving across a histogram chart
- 8608c57 Update jschart to better handle errors while loading datasets
- cae9788 Update jschart by eliminating the use of map
- 2423475 Bug fix for jschart to pass a proper reference to the SVG to saveSvgAsPng
- 826e5d7 Update jschart by eliminating as many global variables as possible to avoid out of scope references
- 521cb95 Update jschart to minimize global variable references to the charts object
- 74b30a8 Update jschart with cleanups and optimizations
- 932679a Benchmark and iteration summary/processing scripts, JSON files and MoonGen benchmark support
- 775f208 Remove duplicate data collected by sosreports
- a395811 Links to revised documentation.
- e6605d6 Add memory usage pidstat graphs
- 124c787 Server installation link added.
- feb8aed bgtasks --> pbench-server
- f51df98 Links to revised docs.
- d21eefa Server version bump.
- 66382bb Add server activation unit test.
- 455c7f8 Fix command path.
- df7aaab Allow different set-ups during server activation.
- b63bdf5 Fix quoting of patterns for pidstat.

* Version 0.38

** Installation                                                    :external:
There are no installation changes in this release: see the
[[file:../agent/installation.org][Installation Instructions]] for how to install.

After installation or update, you should have version 0.38-1g0db11ba
of the pbench-agent RPM installed.

** agent
*** Backward incompatibilities
In the v0.36 timeframe, all pbench scripts and benchmarks that are
normally accessible were renamed: those that did not have a prefix at
all were renamed with a "pbench-" prefix; the benchmarks had a
"pbench_" prefix and were renamed for consistency with a "pbench-"
prefix as well.

In v0.37, there were compatibility links to the old names in util-scripts.

In v0.38, these links have been deleted: you will have to make sure
that you use (and all your scripts use) the names with the "pbench-"
prefix.

*** New features
Please submit suggestions/issues to the [[https://github.com/distributed-system-analysis/pbench/issues][issue tracker]].

**** New graphs

The major change in this release is the replacement of the original
nvd3 graphs with graphs produced by a library written by Karl Rister.
The advantage of this library is that it is much less demanding on
the browser than the original graph library.

Note that it uses the same CSV files that the original graphs used,
which it downloads from the server[fn:1]: big data sets are still
going to incur long time penalties for the transfer. The difference is
that once the download is complete, your browser will stand a much
better chance of staying alive and able to display the graphs.

[fn:1] Unless you install locally - see [[http://pbench.example.com/server/pbench-web-server.html][PBench web server]] for instructions.

*** Bug fixes

**** Fixed the RPM names for tools and benchmarks to include the pbench- prefix
PBench will now be able to find and install the correct RPMs (with the
current exception of pbench-iperf as noted above).

**** Fixed the URL for the COPR repo
The documentation on GitHub was pointing to a non-existent place for
the COPR pbench-agent RPM: it used a sanitized =example.com=
address. This was fixed, but note that the documentation still
contains dead links and will undergo a significant overhaul for
the next release.

