doc/release-notes/RELEASE-NOTES.html

<li><a id="org52ad324"></a>Safer killing of tools<br />
<div class="outline-text-5" id="text-org52ad324">
<p>
A safer kill has been implemented for all the tools that are linked to
<code>kvm-spinlock</code>.  Assuming no problems surface, the sar-based tools
will get the same treatment in upcoming releases.
</p>
</div>
</li>

<li><a id="org8bb200f"></a>Screen session names were too long<br />
<div class="outline-text-5" id="text-org8bb200f">
<p>
The screen command fails when the name of the screen session (-S) is
very long. This happens when the iteration full name is quite long. A
fix for this uses only the iteration number, reducing the screen
name to a safe length.
</p>
</div>
</li>
<li><a id="org081d92a"></a>Fixes to graph rendering<br />
<div class="outline-text-5" id="text-org081d92a">
<p>
See <a href="#web-server-0.39">web-server</a> below.
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgc5a4114" class="outline-3">
<h3 id="orgc5a4114">server</h3>
<div class="outline-text-3" id="text-orgc5a4114">
<p>
Server installation was simplified in v0.38: there is an RPM on COPR that can be used
for installation, but as for the pbench-agent, it is not completely self-contained: one
needs to install various configuration files and generate a directory structure for apache,
a directory structure for results and a crontab that invokes the various scripts to process
incoming results and make them available for viewing on the web.
</p>

<p>
This release adds scripts to do these tasks somewhat more conveniently. It is possible to
use these scripts from an RPM that installs the config files and then invokes the scripts to
finish the installation. But it is also possible to do these steps manually. See the
<a href="file:///home/nick/src/internal/pbench/doc/server/installation.html">server installation guide</a> for details.
</p>
</div>
</div>

<div id="outline-container-org28aa7f6" class="outline-3">
<h3 id="web-server-0.39"><a id="org28aa7f6"></a>web-server</h3>
<div class="outline-text-3" id="text-web-server-0.39">
<p>
The pbench-web-server RPM has been updated with many fixes, cleanups
and optimizations.  Changes that are user-visible are:
</p>

<ul class="org-ul">
<li>Update jschart to better handle errors while loading datasets</li>
<li>Update jschart to support alternative csv file formatting</li>
<li>Fix a jschart bug where the wrong clip-path is referenced</li>
<li>Update jschart to add percentiles to the values displayed in the
table when the mouse is moving across a histogram chart</li>
</ul>

<p>
If you have it installed, you probably want to update:
</p>
<pre class="example">
dnf clean expire-cache
dnf update pbench-web-server
</pre>
<p>
(or the yum equivalents.)  The current version available from COPR
is 0.3-19gaf1ffe4.
</p>
</div>
</div>

<div id="outline-container-org9d680e3" class="outline-3">
<h3 id="org9d680e3">Changelog</h3>
<div class="outline-text-3" id="text-org9d680e3">
<ul class="org-ul">
<li>9c2554f Bump versions for various benchmarks.</li>
<li>a02ad33 Bump VERSION.</li>
<li>48b8c27 Fix condition for warning of already running tools.</li>
<li>f4f5618 Add unit tests.</li>
<li>cf59a06 Check status of backgrounded commands in pbench-postprocess-tools.</li>
<li>fe15a81 Catch pipeline failures and return proper error status.</li>
<li>75ca51c Use pidof -x to get list of pids.</li>
<li>7bbb4dd Revert the change to perf.</li>
<li>11a0ad9 Add unit tests for safe_kill.</li>
<li>fa80b08 Safer kill: check for strange situations and deal with them.</li>
<li>862e68b Change the name of the config file in profile.</li>
<li>9e0ecef Fix pbench-agent-config-activate and add unit test.</li>
<li>19039eb Allow partial execution of unittests.</li>
<li>57b56e7 Fix links to point to DSA github.io area.</li>
<li>d720f61 updated pprof to point to correct package name for "go" it is golang, not go - added tool_bin to point to /usr/bin/go</li>
<li>ee321d6 Add missing '$'</li>
<li>d38ba9b Reduce screen session name to avoid screen error</li>
<li>66c6996 Update jschart's d3-queue support from version 2 to version 3</li>
<li>bc34df8 Update jschart to support alternative csv file formatting</li>
<li>343f715 Fix a jschart bug where the wrong clip-path is referenced</li>
<li>333978c Update jschart to add percentiles to the values displayed in the table when the mouse is moving across a histogram chart</li>
<li>8608c57 Update jschart to better handle errors while loading datasets</li>
<li>cae9788 Update jschart by eliminating the use of map</li>
<li>2423475 Bug fix for jschart to pass a proper reference to the SVG to saveSvgAsPng</li>
<li>826e5d7 Update jschart by eliminating as many global variables as possible to avoid out of scope references</li>
<li>521cb95 Update jschart to minimize global variable references to the charts object</li>
<li>74b30a8 Update jschart with cleanups and optimizations</li>
<li>932679a Benchmark and iteration summary/processing scripts, JSON files and MoonGen benchmark support</li>
<li>775f208 Remove duplicate data collected by sosreports</li>
<li>a395811 Links to revised documentation.</li>
<li>e6605d6 Add memory usage pidstat graphs</li>
<li>124c787 Server installation link added.</li>
<li>feb8aed bgtasks &#x2013;&gt; pbench-server</li>
<li>f51df98 Links to revised docs.</li>
<li>d21eefa Server version bump.</li>
<li>66382bb Add server activation unit test.</li>
<li>455c7f8 Fix command path.</li>
<li>df7aaab Allow different set-ups during server activation.</li>
<li>b63bdf5 Fix quoting of patterns for pidstat.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge79d8b1" class="outline-2">
<h2 id="orge79d8b1">Version 0.38</h2>
<div class="outline-text-2" id="text-orge79d8b1">
</div>
<div id="outline-container-org5122b32" class="outline-3">
<h3 id="org5122b32">Installation</h3>
<div class="outline-text-3" id="text-org5122b32">
<p>
There are no installation changes in this release: see the
<a href="../agent/installation.html">Installation Instructions</a> for how to install.
</p>

<p>
After installation or update, you should have version 0.38-1g0db11ba
of the pbench-agent RPM installed.
</p>
</div>
</div>

<div id="outline-container-org8b197d0" class="outline-3">
<h3 id="org8b197d0">agent</h3>
<div class="outline-text-3" id="text-org8b197d0">
</div>
<ul class="org-ul">
<li><a id="org23ee9da"></a>Backward incompatibilities<br />
<div class="outline-text-4" id="text-org23ee9da">
<p>
In the v0.36 timeframe, all pbench scripts and benchmarks that are
normally accessible were renamed: those that did not have a prefix at
all were renamed with a "pbench-" prefix; the benchmarks had a
"pbench_" prefix and were renamed for consistency with a "pbench-"
prefix as well.
</p>

<p>
In v0.37, there were compatibility links to the old names in util-scripts.
</p>

<p>
In v0.38, these links have been deleted: you will have to make sure
that you use (and all your scripts use) the names with the "pbench-"
prefix.
</p>
</div>
</li>

<li><a id="org31aca30"></a>New features<br />
<div class="outline-text-4" id="text-org31aca30">
<p>
Please submit suggestions/issues to the <a href="https://github.com/distributed-system-analysis/pbench/issues">issue tracker</a>.
</p>
</div>

<ul class="org-ul">
<li><a id="org7b17c86"></a>New graphs<br />
<div class="outline-text-5" id="text-org7b17c86">
<p>
The major change in this release is the replacement of the original
nvd3 graphs with graphs produced by a library written by Karl Rister.
The advantage of this library is that it is much less demanding on
the browser than the original graph library.
</p>

<p>
Note that it uses the same CSV files that the original graphs used,
which it downloads from the server<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>: big data sets are still
going to incur long time penalties for the transfer. The difference is
that once the download is complete, your browser will stand a much
better chance of staying alive and able to display the graphs.
</p>
</div>
</li>
</ul>
</li>

<li><a id="orgfabab12"></a>Bug fixes<br />
<ul class="org-ul">
<li><a id="org7b0de96"></a>Fixed the RPM names for tools and benchmarks to include the pbench- prefix<br />
<div class="outline-text-5" id="text-org7b0de96">
<p>
PBench will now be able to find and install the correct RPMs (with the
current exception of pbench-iperf as noted above).
</p>
</div>
</li>

<li><a id="orgcb03e2a"></a>Fixed the URL for the COPR repo<br />
<div class="outline-text-5" id="text-orgcb03e2a">
<p>
The documentation on GitHub was pointing to a non-existent place for
the COPR pbench-agent RPM: it used a sanitized <code>example.com</code>
address. This was fixed, but note that the documentation still
contains dead links and will undergo a significant overhaul for
the next release.
</p>
</div>
</li>
