doc/release-notes/RELEASE-NOTES.html

<li><a id="org662405b"></a>The pbench-kiil-tools symlink in the repo was wrong.<br />
<div class="outline-text-5" id="text-org662405b">
<p>
That was fixed, but the bug did not and does not have any effect on a
local installation: those symlinks are created on the fly by an RPM
%post action.
</p>
</div>
</li>

<li><a id="org260beea"></a>The sar script was modified to handle user-defined options.<br />
<div class="outline-text-5" id="text-org260beea">
<p>
Note however that if you use non-standard options, the postprocessing
step for the sar tool (and its relatives) will be skipped, since
pbench does not know how to handle the modified output.
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>


<div id="outline-container-orgefaa791" class="outline-3">
<h3 id="orgefaa791">server</h3>
<div class="outline-text-3" id="text-orgefaa791">
<p>
The server has now been organized in the same way as the agent: there
is an external RPM available from COPR that includes all the scripts,
and some configuration scripts that can be used to install the config
file and perform the rest of the server configuration. See the <a href="../server/installation.html">server
installation guide</a>.
</p>
</div>
</div>

<div id="outline-container-orgb9333f3" class="outline-3">
<h3 id="orgb9333f3">web-server</h3>
<div class="outline-text-3" id="text-orgb9333f3">
<p>
There is an RPM available on COPR that allows local viewing of graphs,
both in the v0.2 format (Andrew's graphs using nvd3) or in the v0.3
format (Karl's graphs using d3). This now includes Karl's latest fixes.
If you have installed an older version, please upgrade. The current version
on COPR is 0.3-10.
</p>
</div>
</div>

<div id="outline-container-org0c88b7c" class="outline-3">
<h3 id="org0c88b7c">Fedora 24 RPMs on COPR</h3>
<div class="outline-text-3" id="text-org0c88b7c">
<p>
Fedora 24 has been added to the build list and Fedora 21 has been
deleted from it, for all the RPMS (benchmarks, tools,
pbench-agent, pbench-server, pbench-web-server, configtools).
</p>

<p>
One benchmark RPM (<code>pbench-iperf</code>) is currently failing to build. This
will be fixed shortly.
</p>
</div>
</div>

<div id="outline-container-org0808282" class="outline-3">
<h3 id="org0808282">Changelog</h3>
<div class="outline-text-3" id="text-org0808282">
<ul class="org-ul">
<li>4a65484 Version bump.</li>
<li>0d5a976 Delete compatibility wrapper.</li>
<li>2dff665 Wrong link for pbench-kill-tools.</li>
<li>58dbb63 Update jschart and fix a small bug by cleaning up the y axis label updating code</li>
<li>a9ac750 Fix a bug in the jschart tooltip implementation when the tooltip belongs to an Y axis label</li>
<li>8ca3d37 Long overdue cleanup of the jschart style and class code</li>
<li>99fc942 Update the jschart legend rectangle outlining code to work with Firefox and vector zooming</li>
<li>ef211e8 Update jschart live_update to a timeseries data model which uses milliseconds since the epoch timestamps</li>
<li>b4372f6 Update jschart with a new filtering capability based on the dataset name and resort the table (if sorting is enabled) when datasets are hidden or unhidden</li>
<li>281d89c Update the jschart show/hide all events to use static functions with locally scoped variables</li>
<li>9453829 Update jschart threshold application events to use static functions with locally scoped variables</li>
<li>76590ed Update the the jschart dataset mouseover, mouseout, and click events to use static functions with locally scoped variables</li>
<li>844b87b Update the jschart viewport event handlers to use static functions with locally scoped variables instead of closures</li>
<li>3bef541 Update jschart to eliminate some calls to map that are made often during some runtime behaviors</li>
<li>6dbc809 Update jschart by replacing many data accesor closures with static functions</li>
<li>82a0151 Update jschart to display the datasets value in the table that most closely aligns with the cursor's position in the viewport</li>
<li>3a8cd33 Remove some dead code from jschart</li>
<li>94c0808 Update the jschart table creations to use D3 principles to improve maintainability and reduce code bloat</li>
<li>c332ef9 Update jschart to improve maintainability and performance</li>
<li>5d83c24 Update jschart to be able to apply a dynamic threshold based on a a dataset's maximum y value or y mean</li>
<li>325f17e Update the jschart live update controls to fix some bugs introduced with the recent code churn</li>
<li>25bf0b1 Update jschart to automatically sort the datasets in descending order based on their mean by default</li>
<li>5ea4df3 Update jschart to honor the threshold and use it to determine if datasets should be automatically hidden</li>
<li>b276f78 Move some jschart hard coded values into global variables for easier maintanance and use moving forward</li>
<li>3a45dfa Update jschart to be more dynamic when hiding and unhiding datasets</li>
<li>44d5238 Allow hidden datasets in jschart to be unhidden by clicking their table row</li>
<li>9b000bf Add jschart support for log scale on the x and y axis</li>
<li>3534f88 Update the jschart axes references to conform to other chart object references</li>
<li>3bce44d Update the jschart axes without doing DOM searches</li>
<li>a1af8da Refactor the code to use a global array of chart objects with references to all chart elements and data that may be accessed at runtime</li>
<li>b1e93ea Squash some tooltip bugs</li>
<li>69813a4 Add the ability to hide all or individual datasets and the requisite ability to unhide them</li>
<li>09f33a5 Refactor the dataset highlighting code to track state and improve performance</li>
<li>5f0e909 Add a link from a chart_ref to it's datasets and links from the datasets to their DOM objects</li>
<li>bf5732f Update the legend boxes to always have a constant colored outline</li>
<li>e15db96 Update the description and dependency information for jschart</li>
<li>bbc21f0 Update the wording that refers to the EPL LICENSE.TXT file locations</li>
<li>dcbf39b Update the verbage in the demo web server to better reflect it's usage</li>
<li>388d319 Add a simple web server from LPCPU for use in demoing/testing jschart</li>
<li>43ed280 Add a jschart demo for testing purposes</li>
<li>db0ece1 Add support for a new data model type called histogram</li>
<li>c99c7d3 More jschart whitespace formatting cleanups</li>
<li>c8cfe1e Fix a bug in the jschart "Apply X-Axis Zoom to All" feature caused by the new support for timeseries charts</li>
<li>a2f1056 Fix some bugs in the zoom_it function in jschart when the data model is timeseries:</li>
<li>e471473 Remove dead code from the handle_brush_actions function in jschart</li>
<li>87c7647 Update the mouse coordinate display to support when the chart is timeseries</li>
<li>583ef9e Fixup timezone and time formatting support, defaulting to UTC</li>
<li>9f0a3a7 Update jschart to use a dynamic x-axis label showing the (zoomed) time range when the chart is timeseries</li>
<li>3534125 Update GenData to use jschart</li>
<li>bb36819 Update jschart to be compatible with GenData chart type specifications</li>
<li>3b3889f Update the jschart highlight functions to have more descriptive names</li>
<li>1f354a7 Update D3 Queue initialization to match d3-queue code available via npm</li>
<li>28d51b9 Add support for saveSvgAsPng to jschart</li>
<li>3029052 Add support for specifying whether a jschart is a XY plot or timeseries</li>
<li>247216b Remove the jschart assertion that the x-axis domain should have a minimum=0 unless otherwise specified</li>
<li>72a42e9 Add support for loading CSV data files into jschart</li>
<li>785b27c Update jschart.js to dynamically build the summary table at runtime</li>
<li>c8b781a Initial commit of jschart files pulled from LPCPU</li>
<li>7224a5a Clean up the list file.</li>
<li>ef3f12b Fix the COPR repo URL.</li>
<li>6a1e74f Store cron job script logs in the local file system.</li>
<li>fc9d61d modified oc scrit -&gt; fixed typo -&gt; if decided to start too, instructed to install 'expect' package - necessary for unbuffer</li>
<li>02eb062 Fix the calls to check_installed_rpm in all the benchmarks.</li>
<li>6c48dbe Script rename: metadata-log &#x2013;&gt; pbench-metadata-log</li>
<li>2b8b991 Modify the sar script (and its relatives) to handle user-defined options.</li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Unless you install locally - see <a href="http://pbench.example.com/server/pbench-web-server.html">PBench web server</a> for instructions.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Page updated: 2017-06-27 Tue 14:29</p>
</div>
</body>
</html>
